BSP/src/InformationRegisters/_ГруппыДоступа/_ГруппыДоступа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>_ГруппыДоступа</name>
  <resources>
    <name>ЗначениеДоступа</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

BSP/src/InformationRegisters/_ГруппыДоступа/ManagerModule.bsl
Функция ДоступРазрешен(Пользователь) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	_ГруппыДоступа.ЗначениеДоступа
		|ИЗ
		|	РегистрСведений._ГруппыДоступа КАК _ГруппыДоступа
		|ГДЕ
		|	_ГруппыДоступа.Пользователь = &Пользователь
		|	И _ГруппыДоступа.ЗначениеДоступа = &ЗначениеДоступа";
	
	Запрос.УстановитьПараметр("ЗначениеДоступа", Пользователи.АвторизованныйПользователь());
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат НЕ РезультатЗапроса.Пустой();
	
КонецФункции
